Repository: fxpar/abc2xmlGUI
Catalog: locale/*/LC_MESSAGES/abc2xmlGUI.po
Languages: de, fr, ga, pt

source: All files
de: Alle Dateien
fr: Tous les fichiers
ga: Comhaid uilig
pt: Todos os arquivos

source: This program needs abc2xml and/or xml2abc from wim.vree.org to work.
de: Dieses Programm benötigt abc2xml bzw. xml2abc von wim.vree.org.
fr: Ce programme a besoin de abc2xml et/ou xml2abc disponibles à wim.vree.org.
ga: Is gá abc2xml agus/nó xml2abc de wim.vree.org leis an clár seo.
pt: Este programa precisa do abc2xml e/ou xml2abc de wim.vree.org para funcionar.

source: INSTALLATION ============ Copy abc2xml.py and/or xml2abc.py into this program's folder: {folder} Should you already have the files in a different location, enter their full path into the ini file in the same folder. If you are running Windows, make sure that Python is installed and that the path to Python is in your PATH environment variable. Alternatively, use abc2xml.exe and xml2abc.exe files instead.
de: INSTALLATION ============ abc2xml.py bzw xml2abc.py in diesen Programmordner kopieren: {folder} Sollten die Dateien schon woanders installiert sein, diesen Pfad in die Ini-Datei im gleichen Ordner eintragen. Unter Windows muss Python installiert sein und der Pfad zu Python in der Umgebungsvariable PATH inkludiert sein. Alternativ kann man auch abc2xml.exe und xm2abc.exe verwenden.
fr: INSTALLATION ============ Copier abc2xml.py et/ou xml2abc.py dans le répertoire du programme: {folder} Si vous aves déjà ces outils installés dans un chemin différent, Entrez leur chemin absolu dans le fichier ini dans ce répertoire. Si vous utilisez Windows, assurez-vous que Python est installé et que son chemin d'accès est dans votre variable d'environnement PATH. Autrement vous pouvez utiliser abc2xml.exe et xm2abc.exe à la place.
ga: SUITEÁIL ====== Cóipeáil abc2xml.py agus/nó xml2abc.py san fhillteán den chlár seo: {folder} Má tá na comhaid in áit difriúil agat fós, cuir a gcosán iomlán isteach sa chomhad ini san fhillteán céanna. Má tá Windows ar siúl agat, bí cinnte go bhfuil Python suiteáilte agat agus an cosán go Python san athróg timpeallachta PATH. De rogha air sin, bain usáid as abc2xml.exe agus xm2abc.exe.
pt: INSTALAÇÃO ========== Copie abc2xml.py e/ou xml2abc.py para a pasta deste programa: {pasta} Se você já tiver os arquivos em um local diferente, digite o caminho completo no arquivo ini na mesma pasta. Se você estiver no Windows, verifique se o Python está instalado e que o caminho para Python está em sua variável de ambiente PATH. Como alternativa, use os arquivos abc2xml.exe e xml2abc.exe.

source: INSTRUCTIONS ============ 1. Paste abc/XML or select file using button 'Open'. 2. Change abc/XML as desired and/or select part of it. Changed abc/XML can be saved using button 'Save'. 3. Convert using button 'Convert'.
de: ANLEITUNG ========= 1. abc/XML einfügen oder eine Datei über die Taste 'Öffnen' wählen. 2. abc/XML nach Wunsch bearbeiten bzw. Teile auswählen. Geändertes abc/XML kann mit der Taste 'Speichern' gespeichert werden. 3. Konvertieren mittels Taste 'Konvertieren'.
fr: INSTRUCTIONS ============ 1. Copier du texte abc/XML ou sélectionner un fichier avec le Bouton 'Ouvrir'. 2. Modifier le texte abc/XML ou sélectionner une partie si besoin. L'abc/XML changé peut être enregistré en utilisant le bouton 'Enregistrer'. 3. Convertir en utilisant le Bouton 'Convertir'.
ga: TREORACHA ========= 1. Greamhaigh ab/XML nó roghnaigh comhad leis an cnaipe 'Oscail'. 2. Athraigh abc/XML de réir mar atá ag teastáil agus/nó roghnaigh cuid den téacs. Is féidir an abc/XML athraithe a shábháil leis an cnaipe 'Sábháil'. 3. Tiontaigh ag baint usáid as cnaipe 'Tiontaigh'.
pt: INSTRUÇÕES ========== 1. Cole abc/XML ou selecione o arquivo usando o botão 'Abrir'. 2. Altere abc/XML conforme desejado e/ou selecione parte dele. Abc/XML alterado pode ser salvo usando o botão 'Salvar'. 3. Converta usando o botão 'Converter'.

source: score line-break
de: neue Notenzeile
fr: retour à la ligne dans la partition
ga: line nua scóir

source: Open
de: Öffnen
fr: Ouvrir
ga: Oscail
pt: Abrir

source: Save
de: Speichern
fr: Enregistrer
ga: Sábháil
pt: Salvar

source: Convert
de: Konvertieren
fr: Convertir
ga: Tiontaigh
pt: Converter

source: This function needs abc2xml. Copy file into abc2xmlGUI folder or enter path into abc2xmlGUI.ini.
de: Diese Funktion benötigt abc2xml. Datei in den abc2xmlGUI-Ordner kopieren oder den Pfad in die abc2xmlGUI.ini eintragen.
fr: Cette fonction a besoin de abc2xml. Copier le programme dans le répertoire abc2xmlGUI ou entrez son chemin d'accès dans le fichier abc2xmlGUI.ini.
ga: Is gá abc2xml leis an bhfeidhm seo. Cóipeáil an comhad san fhillteán abc2xmlGUI nó cuir isteach a chosán san abc2xmlGUI.ini.
pt: Esta função precisa do abc2xml. Copie o arquivo para a pasta abc2xmlGUI ou insira o caminho em abc2xmlGUI.ini.

source: Select file
de: Datei auswählen
fr: Sélectionner fichier
ga: Roghnaigh comhad
pt: Selecione o arquivo

source: Python not found! Please check your installation and environment variables.
de: Python wurde nicht gefunden! Überprüfen Sie Ihre Installation und die Umgebungsvariablen.
fr: Python non trouvé ! Veuillez vérifier son installation et les variables d'environnement.
ga: Níl Python a fháil! Seiceáil do shuiteáil, le do thoil, agus na hathróga timpeallachta.
pt: Python não encontrado! Verifique sua instalação e as variáveis de ambiente.

source: No abc or XML to convert.
de: Kein abc oder XML zum Konvertieren vorhanden.
fr: Pas de données abc ou XML à convertir.
ga: Níl aon abc nó XML le thiontaigh.
pt: Nenhum abc ou XML para converter.

source: quebra de linha de pontuação
pt: line nua scóir
